In [14]:
import pandas as pd
import re

In [5]:
pd.Period?

Init signature:
pd.Period(
    value=None,
    freq=None,
    ordinal=None,
    year=None,
    month=None,
    quarter=None,
    day=None,
    hour=None,
    minute=None,
    second=None,
)
Docstring:
Represents a period of time.

Parameters
----------
value : Period, str, datetime, date or pandas.Timestamp, default None
    The time period represented (e.g., '4Q2005'). This represents neither
    the start or the end of the period, but rather the entire period itself.
freq : str, default None
    One of pandas period strings or corresponding objects. Accepted
    strings are listed in the
    :ref:`period alias section <timeseries.period_aliases>` in the user docs.
    If value is datetime, freq is required.
ordinal : int, default None
    The period offset from the proleptic Gregorian epoch.
year : int, default None
    Year value of the period.
month : int, default 1
    Month value of the period.
quarter : int, default None
    Quarter value of the period.
day : int, default 1
    Day value of the period.
hour : int, default 0
    Hour value of the period.
minute : int, default 0
    Minute value of the period.
second : int, default 0
    Second value of the period.

Examples
--------
>>> period = pd.Period('2012-1-1', freq='D')
>>> period
Period('2012-01-01', 'D')
File:           c:\users\soumy\appdata\local\programs\python\python312\lib\site-packages\pandas\_libs\tslibs\period.cp312-win_amd64.pyd
Type:           type
Subclasses:

In [10]:
df=pd.DataFrame({'a':[1,2,3,4],'b':[4,5,6,7]},index=['aa','bb','cc','dd'])
df

    a  b
aa  1  4
bb  2  5
cc  3  6
dd  4  7

In [11]:
df.index

Index(['aa', 'bb', 'cc', 'dd'], dtype='object')

#### You are given a dataframe that contains the details about various events in different cities. For those cities which start with the keyword ‘New’ or ‘new’, change it to ‘New_’.

In [17]:
df = pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
 
index_ = [pd.Period('02-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
 
df.index = index_
print(df)

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

In [18]:
df.replace(to_replace='^(n|N)ew',value='New_',regex=True)

                 City        Event   Cost
2018-02     New_ York        Music  10000
2018-04       Parague       Poetry   5000
2018-06    New_ Delhi      Theatre  15000
2018-10        Venice       Comedy   2000
2018-12  New_ Orleans  Tech_Summit  12000

#### You are given a dataframe containing details about various events in different cities. The names of certain cities contain some additional details enclosed in a bracket. Search for such names and remove the additional details.

In [19]:
df = pd.DataFrame({'City':['New York (City)', 'Parague', 'New Delhi (Delhi)', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
 
index_ = [pd.Period('02-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]

df.index = index_
print(df)

                      City        Event   Cost
2018-02    New York (City)        Music  10000
2018-04            Parague       Poetry   5000
2018-06  New Delhi (Delhi)      Theatre  15000
2018-10             Venice       Comedy   2000
2018-12        new Orleans  Tech_Summit  12000

In [22]:
df.replace(to_replace='\(.*\)',value='',regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\('
<>:1: SyntaxWarning: invalid escape sequence '\('
C:\Users\soumy\AppData\Local\Temp\ipykernel_8172\977753957.py:1: SyntaxWarning: invalid escape sequence '\('
  df.replace(to_replace='\(.*\)',value='',regex=True)

                City        Event   Cost
2018-02    New York         Music  10000
2018-04      Parague       Poetry   5000
2018-06   New Delhi       Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000